Revit 2024 API
BuiltInFailures.StairRampFailures.ArcRunRadiusTooSmall Property
 Can't create Run. Run radius is too small.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ArcRunRadiusTooSmall { get; }
Visual Basic
Public Shared ReadOnly Property ArcRunRadiusTooSmall As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ArcRunRadiusTooSmall {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace